lilindian16/RE_SWC_FW/lib/ch32_usbd/src/ch32x035_usbd.h
/********************************** (C) COPYRIGHT
 * ******************************* File Name          : ch32x035_usbfs_device.h
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2024/04/16
 * Description        : This file contains all the functions prototypes for the
 *                      USBFS firmware library.
 *********************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *
 * Modified by Jaime Sequeira for use with Car Stereo Volume Knob Kit
 *******************************************************************************/

#ifndef __CH32X035_USBD_H_
#define __CH32X035_USBD_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "debug.h"
#include "stdbool.h"
#include "stdint.h"
#include "string.h"

/******************************************************************************/
/* Global Define */
#ifndef __PACKED
#define __PACKED __attribute__((packed))
#endif

/* end-point number */
#define DEF_UEP_IN  0x80
#define DEF_UEP_OUT 0x00
#define DEF_UEP0    0x00
#define DEF_UEP1    0x01
#define DEF_UEP2    0x02
#define DEF_UEP3    0x03
#define DEF_UEP4    0x04
#define DEF_UEP5    0x05
#define DEF_UEP6    0x06
#define DEF_UEP7    0x07
#define DEF_UEP_NUM 8

#define USBFSD_UEP_RX_EN   0x08
#define USBFSD_UEP_TX_EN   0x04
#define USBFSD_UEP_BUF_MOD 0x01
#define DEF_UEP_DMA_LOAD                                                       \
  0 /* Direct the DMA address to the data to be processed */
#define DEF_UEP_CPY_LOAD 1 /* Use memcpy to move data to a buffer */

/* Setup Request Packets */
#define pUSBFS_SetupReqPak ((PUSB_SETUP_REQ)USBFS_EP0_4Buf)

#define USB_IOEN        0x00000080
#define USB_PHY_V33     0x00000040
#define UDP_PUE_MASK    0x0000000C
#define UDP_PUE_DISABLE 0x00000000
#define UDP_PUE_35UA    0x00000004
#define UDP_PUE_10K     0x00000008
#define UDP_PUE_1K5     0x0000000C

#define UDM_PUE_MASK    0x00000003
#define UDM_PUE_DISABLE 0x00000000
#define UDM_PUE_35UA    0x00000001
#define UDM_PUE_10K     0x00000002
#define UDM_PUE_1K5     0x00000003

/*******************************************************************************/
/* USB Communication Related Macro Definition */

/* USB PID */
#ifndef USB_PID_SETUP
#define USB_PID_NULL  0x00
#define USB_PID_SOF   0x05
#define USB_PID_SETUP 0x0D
#define USB_PID_IN    0x09
#define USB_PID_OUT   0x01
#define USB_PID_NYET  0x06
#define USB_PID_ACK   0x02
#define USB_PID_NAK   0x0A
#define USB_PID_STALL 0x0E
#define USB_PID_DATA0 0x03
#define USB_PID_DATA1 0x0B
#define USB_PID_PRE   0x0C
#endif

/* USB standard device request code */
#ifndef USB_GET_DESCRIPTOR
#define USB_GET_STATUS        0x00
#define USB_CLEAR_FEATURE     0x01
#define USB_SET_FEATURE       0x03
#define USB_SET_ADDRESS       0x05
#define USB_GET_DESCRIPTOR    0x06
#define USB_SET_DESCRIPTOR    0x07
#define USB_GET_CONFIGURATION 0x08
#define USB_SET_CONFIGURATION 0x09
#define USB_GET_INTERFACE     0x0A
#define USB_SET_INTERFACE     0x0B
#define USB_SYNCH_FRAME       0x0C
#endif

#define DEF_STRING_DESC_LANG 0x00
#define DEF_STRING_DESC_MANU 0x01
#define DEF_STRING_DESC_PROD 0x02
#define DEF_STRING_DESC_SERN 0x03

/* USB hub class request code */
#ifndef HUB_GET_DESCRIPTOR
#define HUB_GET_STATUS     0x00
#define HUB_CLEAR_FEATURE  0x01
#define HUB_GET_STATE      0x02
#define HUB_SET_FEATURE    0x03
#define HUB_GET_DESCRIPTOR 0x06
#define HUB_SET_DESCRIPTOR 0x07
#endif

/* USB HID class request code */
#ifndef HID_GET_REPORT
#define HID_GET_REPORT   0x01
#define HID_GET_IDLE     0x02
#define HID_GET_PROTOCOL 0x03
#define HID_SET_REPORT   0x09
#define HID_SET_IDLE     0x0A
#define HID_SET_PROTOCOL 0x0B
#endif

/* Bit Define for USB Request Type */
#ifndef USB_REQ_TYP_MASK
#define USB_REQ_TYP_IN             0x80
#define USB_REQ_TYP_OUT            0x00
#define USB_REQ_TYP_READ           0x80
#define USB_REQ_TYP_WRITE          0x00
#define USB_REQ_TYP_MASK           0x60
#define USB_REQ_TYP_STANDARD       0x00
#define USB_REQ_TYP_CLASS          0x20
#define USB_REQ_TYP_VENDOR         0x40
#define USB_REQ_TYP_RESERVED       0x60
#define USB_REQ_RECIP_MASK         0x1F
#define USB_REQ_RECIP_DEVICE       0x00
#define USB_REQ_RECIP_INTERF       0x01
#define USB_REQ_RECIP_ENDP         0x02
#define USB_REQ_RECIP_OTHER        0x03
#define USB_REQ_FEAT_REMOTE_WAKEUP 0x01
#define USB_REQ_FEAT_ENDP_HALT     0x00
#endif

/* USB Descriptor Type */
#ifndef USB_DESCR_TYP_DEVICE
#define USB_DESCR_TYP_DEVICE  0x01
#define USB_DESCR_TYP_CONFIG  0x02
#define USB_DESCR_TYP_STRING  0x03
#define USB_DESCR_TYP_INTERF  0x04
#define USB_DESCR_TYP_ENDP    0x05
#define USB_DESCR_TYP_QUALIF  0x06
#define USB_DESCR_TYP_SPEED   0x07
#define USB_DESCR_TYP_OTG     0x09
#define USB_DESCR_TYP_BOS     0X0F
#define USB_DESCR_TYP_HID     0x21
#define USB_DESCR_TYP_REPORT  0x22
#define USB_DESCR_TYP_PHYSIC  0x23
#define USB_DESCR_TYP_CS_INTF 0x24
#define USB_DESCR_TYP_CS_ENDP 0x25
#define USB_DESCR_TYP_HUB     0x29
#endif

/* USB Device Class */
#ifndef USB_DEV_CLASS_HUB
#define USB_DEV_CLASS_RESERVED  0x00
#define USB_DEV_CLASS_AUDIO     0x01
#define USB_DEV_CLASS_COMMUNIC  0x02
#define USB_DEV_CLASS_HID       0x03
#define USB_DEV_CLASS_MONITOR   0x04
#define USB_DEV_CLASS_PHYSIC_IF 0x05
#define USB_DEV_CLASS_POWER     0x06
#define USB_DEV_CLASS_PRINTER   0x07
#define USB_DEV_CLASS_STORAGE   0x08
#define USB_DEV_CLASS_HUB       0x09
#define USB_DEV_CLASS_VEN_SPEC  0xFF
#endif

/* USB Hub Class Request */
#ifndef HUB_GET_HUB_DESCRIPTOR
#define HUB_CLEAR_HUB_FEATURE  0x20
#define HUB_CLEAR_PORT_FEATURE 0x23
#define HUB_GET_BUS_STATE      0xA3
#define HUB_GET_HUB_DESCRIPTOR 0xA0
#define HUB_GET_HUB_STATUS     0xA0
#define HUB_GET_PORT_STATUS    0xA3
#define HUB_SET_HUB_DESCRIPTOR 0x20
#define HUB_SET_HUB_FEATURE    0x20
#define HUB_SET_PORT_FEATURE   0x23
#endif

/* Hub Class Feature Selectors */
#ifndef HUB_PORT_RESET
#define HUB_C_HUB_LOCAL_POWER   0
#define HUB_C_HUB_OVER_CURRENT  1
#define HUB_PORT_CONNECTION     0
#define HUB_PORT_ENABLE         1
#define HUB_PORT_SUSPEND        2
#define HUB_PORT_OVER_CURRENT   3
#define HUB_PORT_RESET          4
#define HUB_PORT_POWER          8
#define HUB_PORT_LOW_SPEED      9
#define HUB_C_PORT_CONNECTION   16
#define HUB_C_PORT_ENABLE       17
#define HUB_C_PORT_SUSPEND      18
#define HUB_C_PORT_OVER_CURRENT 19
#define HUB_C_PORT_RESET        20
#endif

/* USB UDisk */
#ifndef USB_BO_CBW_SIZE
#define USB_BO_CBW_SIZE 0x1F
#define USB_BO_CSW_SIZE 0x0D
#endif
#ifndef USB_BO_CBW_SIG0
#define USB_BO_CBW_SIG0 0x55
#define USB_BO_CBW_SIG1 0x53
#define USB_BO_CBW_SIG2 0x42
#define USB_BO_CBW_SIG3 0x43
#define USB_BO_CSW_SIG0 0x55
#define USB_BO_CSW_SIG1 0x53
#define USB_BO_CSW_SIG2 0x42
#define USB_BO_CSW_SIG3 0x53
#endif

/* USB CDC Class request code */
#ifndef CDC_GET_LINE_CODING
#define CDC_GET_LINE_CODING                                                    \
  0X21 /* This request allows the host to find out the currently configured    \
          line coding */
#define CDC_SET_LINE_CODING                                                    \
  0x20 /* Configures DTE rate, stop-bits, parity, and number-of-character */
#define CDC_SET_LINE_CTLSTE                                                    \
  0X22 /* This request generates RS-232/V.24 style control signals */
#define CDC_SEND_BREAK                                                         \
  0X23 /* Sends special carrier modulation used to specify RS-232 style break  \
        */
#endif
/*******************************************************************************/
/* USBFS Related Register Macro Definition */

/* R8_USB_CTRL */
#define USBFS_UC_HOST_MODE     0x80
#define USBFS_UC_LOW_SPEED     0x40
#define USBFS_UC_DEV_PU_EN     0x20
#define USBFS_UC_SYS_CTRL_MASK 0x30
#define USBFS_UC_SYS_CTRL0     0x00
#define USBFS_UC_SYS_CTRL1     0x10
#define USBFS_UC_SYS_CTRL2     0x20
#define USBFS_UC_SYS_CTRL3     0x30
#define USBFS_UC_INT_BUSY      0x08
#define USBFS_UC_RESET_SIE     0x04
#define USBFS_UC_CLR_ALL       0x02
#define USBFS_UC_DMA_EN        0x01

