lilindian16/RE_SWC_FW/lib/ch32_usbd/src/ch32x035_usbd.h
/* R8_USB_INT_EN */
#define USBFS_UIE_DEV_SOF  0x80
#define USBFS_UIE_DEV_NAK  0x40
#define USBFS_UID_1_WIRE   0x20
#define USBFS_UIE_FIFO_OV  0x10
#define USBFS_UIE_HST_SOF  0x08
#define USBFS_UIE_SUSPEND  0x04
#define USBFS_UIE_TRANSFER 0x02
#define USBFS_UIE_DETECT   0x01
#define USBFS_UIE_BUS_RST  0x01

/* R8_USB_DEV_AD */
#define USBFS_UDA_GP_BIT    0x80
#define USBFS_USB_ADDR_MASK 0x7F

/* R8_USB_MIS_ST */
#define USBFS_UMS_SOF_PRES   0x80
#define USBFS_UMS_SOF_ACT    0x40
#define USBFS_UMS_SIE_FREE   0x20
#define USBFS_UMS_R_FIFO_RDY 0x10
#define USBFS_UMS_BUS_RESET  0x08
#define USBFS_UMS_SUSPEND    0x04
#define USBFS_UMS_DM_LEVEL   0x02
#define USBFS_UMS_DEV_ATTACH 0x01

/* R8_USB_INT_FG */
#define USBFS_U_IS_NAK                                                         \
  0x80 // RO, indicate current USB transfer is NAK received for USB device mode
#define USBFS_U_TOG_OK   0x40 // RO, indicate current USB transfer toggle is OK
#define USBFS_U_SIE_FREE 0x20 // RO, indicate USB SIE free status
#define USBFS_UIF_FIFO_OV                                                      \
  0x10 // FIFO overflow interrupt flag for USB, direct bit address clear or
       // write 1 to clear
#define USBFS_UIF_HST_SOF                                                      \
  0x08 // host SOF timer interrupt flag for USB host, direct bit address clear
       // or write 1 to clear
#define USBFS_UIF_SUSPEND                                                      \
  0x04 // USB suspend or resume event interrupt flag, direct bit address clear
       // or write 1 to clear
#define USBFS_UIF_TRANSFER                                                     \
  0x02 // USB transfer completion interrupt flag, direct bit address clear or
       // write 1 to clear
#define USBFS_UIF_DETECT                                                       \
  0x01 // device detected event interrupt flag for USB host mode, direct bit
       // address clear or write 1 to clear
#define USBFS_UIF_BUS_RST                                                      \
  0x01 // bus reset event interrupt flag for USB device mode, direct bit address
       // clear or write 1 to clear

/* R8_USB_INT_ST */
#define USBFS_SETUP_ACT                                                        \
  0x80 // RO, indicate current USB transfer SETUP is complete
#define USBFS_UIS_TOG_OK 0x40 // RO, indicate current USB transfer toggle is OK
#define USBFS_UIS_TOKEN_MASK                                                   \
  0x30 // RO, bit mask of current token PID code received for USB device mode
#define USBFS_UIS_TOKEN_OUT   0x00
#define USBFS_UIS_TOKEN_SOF   0x10
#define USBFS_UIS_TOKEN_IN    0x20
#define USBFS_UIS_TOKEN_SETUP 0x30
// bUIS_TOKEN1 & bUIS_TOKEN0: current token PID code received for USB device
// mode
//   00: OUT token PID received
//   01: SOF token PID received
//   10: IN token PID received
//   11: SETUP token PID received
#define USBFS_UIS_ENDP_MASK                                                    \
  0x0F // RO, bit mask of current transfer endpoint number for USB device mode
#define USBFS_UIS_H_RES_MASK                                                   \
  0x0F // RO, bit mask of current transfer handshake response for USB host mode:
       // 0000=no response, time out from device, others=handshake response PID
       // received

/* R8_UDEV_CTRL */
#define USBFS_UD_PD_DIS                                                        \
  0x80 // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define USBFS_UD_DP_PIN 0x20 // ReadOnly: indicate current UDP pin level
#define USBFS_UD_DM_PIN 0x10 // ReadOnly: indicate current UDM pin level
#define USBFS_UD_LOW_SPEED                                                     \
  0x04 // enable USB physical port low speed: 0=full speed, 1=low speed
#define USBFS_UD_GP_BIT 0x02 // general purpose bit
#define USBFS_UD_PORT_EN                                                       \
  0x01 // enable USB physical port I/O: 0=disable, 1=enable

/* R8_UEP4_1_MOD */
#define USBFS_UEP1_RX_EN   0x80 // enable USB endpoint 1 receiving (OUT)
#define USBFS_UEP1_TX_EN   0x40 // enable USB endpoint 1 transmittal (IN)
#define USBFS_UEP1_BUF_MOD 0x10 // buffer mode of USB endpoint 1
// bUEPn_RX_EN & bUEPn_TX_EN & bUEPn_BUF_MOD: USB endpoint 1/2/3 buffer mode,
// buffer start address is UEPn_DMA
//   0 0 x:  disable endpoint and disable buffer
//   1 0 0:  64 bytes buffer for receiving (OUT endpoint)
//   1 0 1:  dual 64 bytes buffer by toggle bit bUEP_R_TOG selection for
//   receiving (OUT endpoint), total=128bytes 0 1 0:  64 bytes buffer for
//   transmittal (IN endpoint) 0 1 1:  dual 64 bytes buffer by toggle bit
//   bUEP_T_TOG selection for transmittal (IN endpoint), total=128bytes 1 1 0:
//   64 bytes buffer for receiving (OUT endpoint) + 64 bytes buffer for
//   transmittal (IN endpoint), total=128bytes 1 1 1:  dual 64 bytes buffer by
//   bUEP_R_TOG selection for receiving (OUT endpoint) + dual 64 bytes buffer by
//   bUEP_T_TOG selection for transmittal (IN endpoint), total=256bytes
#define USBFS_UEP4_RX_EN 0x08 // enable USB endpoint 4 receiving (OUT)
#define USBFS_UEP4_TX_EN 0x04 // enable USB endpoint 4 transmittal (IN)
// bUEP4_RX_EN & bUEP4_TX_EN: USB endpoint 4 buffer mode, buffer start address
// is UEP0_DMA
//   0 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT &
//   IN endpoint) 1 0:  single 64 bytes buffer for endpoint 0 receiving &
//   transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 receiving
//   (OUT endpoint), total=128bytes 0 1:  single 64 bytes buffer for endpoint 0
//   receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint
//   4 transmittal (IN endpoint), total=128bytes 1 1:  single 64 bytes buffer
//   for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//           + 64 bytes buffer for endpoint 4 receiving (OUT endpoint) + 64
//           bytes buffer for endpoint 4 transmittal (IN endpoint),
//           total=192bytes

/* R8_UEP2_3_MOD */
#define USBFS_UEP3_RX_EN   0x80 // enable USB endpoint 3 receiving (OUT)
#define USBFS_UEP3_TX_EN   0x40 // enable USB endpoint 3 transmittal (IN)
#define USBFS_UEP3_BUF_MOD 0x10 // buffer mode of USB endpoint 3
#define USBFS_UEP2_RX_EN   0x08 // enable USB endpoint 2 receiving (OUT)
#define USBFS_UEP2_TX_EN   0x04 // enable USB endpoint 2 transmittal (IN)
#define USBFS_UEP2_BUF_MOD 0x01 // buffer mode of USB endpoint 2

/* R8_UEP567_MOD */

#define USBFS_UEP5_RX_EN 0x02 // enable USB endpoint 5 receiving (OUT)
#define USBFS_UEP5_TX_EN 0x01 // enable USB endpoint 5 transmittal (IN)
#define USBFS_UEP6_RX_EN 0x08 // enable USB endpoint 6 receiving (OUT)
#define USBFS_UEP6_TX_EN 0x04 // enable USB endpoint 6 transmittal (IN)
#define USBFS_UEP7_RX_EN 0x20 // enable USB endpoint 7 receiving (OUT)
#define USBFS_UEP7_TX_EN 0x10 // enable USB endpoint 7 transmittal (IN)

