lilindian16/RE_SWC_FW/lib/ch32_usbd/src/ch32x035_usbd.h
/* R8_UEPn_TX_CTRL */
#define USBFS_UEP_T_AUTO_TOG                                                   \
  (1 << 4) // enable automatic toggle after successful transfer completion on
           // endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define USBFS_UEP_T_TOG                                                        \
  (1 << 6) // prepared data toggle flag of USB endpoint X transmittal (IN):
           // 0=DATA0, 1=DATA1
#define USBFS_UEP_T_RES_MASK                                                   \
  (3 << 0) // bit mask of handshake response type for USB endpoint X transmittal
           // (IN)
#define USBFS_UEP_T_RES_ACK   (0 << 1)
#define USBFS_UEP_T_RES_NONE  (1 << 0)
#define USBFS_UEP_T_RES_NAK   (1 << 1)
#define USBFS_UEP_T_RES_STALL (3 << 0)
// bUEP_T_RES1 & bUEP_T_RES0: handshake response type for USB endpoint X
// transmittal (IN)
//   00: DATA0 or DATA1 then expecting ACK (ready)
//   01: DATA0 or DATA1 then expecting no response, time out from host, for
//   non-zero endpoint isochronous transactions 10: NAK (busy) 11: STALL (error)
// host aux setup

/* R8_UEPn_RX_CTRL, n=0-7 */
#define USBFS_UEP_R_AUTO_TOG                                                   \
  (1 << 4) // enable automatic toggle after successful transfer completion on
           // endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define USBFS_UEP_R_TOG                                                        \
  (1 << 7) // expected data toggle flag of USB endpoint X receiving (OUT):
           // 0=DATA0, 1=DATA1
#define USBFS_UEP_R_RES_MASK                                                   \
  (3 << 2) // bit mask of handshake response type for USB endpoint X receiving
           // (OUT)
#define USBFS_UEP_R_RES_ACK   (0 << 3)
#define USBFS_UEP_R_RES_NONE  (1 << 2)
#define USBFS_UEP_R_RES_NAK   (1 << 3)
#define USBFS_UEP_R_RES_STALL (3 << 2)
// RB_UEP_R_RES1 & RB_UEP_R_RES0: handshake response type for USB endpoint X
// receiving (OUT)
//   00: ACK (ready)
//   01: no response, time out to host, for non-zero endpoint isochronous
//   transactions 10: NAK (busy) 11: STALL (error)

/* R8_UHOST_CTRL */
#define USBFS_UH_PD_DIS                                                        \
  0x80 // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define USBFS_UH_DP_PIN 0x20 // ReadOnly: indicate current UDP pin level
#define USBFS_UH_DM_PIN 0x10 // ReadOnly: indicate current UDM pin level
#define USBFS_UH_LOW_SPEED                                                     \
  0x04 // enable USB port low speed: 0=full speed, 1=low speed
#define USBFS_UH_BUS_RESET                                                     \
  0x02 // control USB bus reset: 0=normal, 1=force bus reset
#define USBFS_UH_PORT_EN                                                       \
  0x01 // enable USB port: 0=disable, 1=enable port, automatic disabled if USB
       // device detached

/* R32_UH_EP_MOD */
#define USBFS_UH_EP_TX_EN    0x40 // enable USB host OUT endpoint transmittal
#define USBFS_UH_EP_TBUF_MOD 0x10 // buffer mode of USB host OUT endpoint
// bUH_EP_TX_EN & bUH_EP_TBUF_MOD: USB host OUT endpoint buffer mode, buffer
// start address is UH_TX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  64 bytes buffer for transmittal (OUT endpoint)
//   1 1:  dual 64 bytes buffer by toggle bit bUH_T_TOG selection for
//   transmittal (OUT endpoint), total=128bytes
#define USBFS_UH_EP_RX_EN    0x08 // enable USB host IN endpoint receiving
#define USBFS_UH_EP_RBUF_MOD 0x01 // buffer mode of USB host IN endpoint
// bUH_EP_RX_EN & bUH_EP_RBUF_MOD: USB host IN endpoint buffer mode, buffer
// start address is UH_RX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  64 bytes buffer for receiving (IN endpoint)
//   1 1:  dual 64 bytes buffer by toggle bit bUH_R_TOG selection for receiving
//   (IN endpoint), total=128bytes

/* R8_UH_SETUP */
#define USBFS_UH_PRE_PID_EN                                                    \
  0x80 // USB host PRE PID enable for low speed device via hub
#define USBFS_UH_SOF_EN 0x40 // USB host automatic SOF enable

/* R8_UH_EP_PID */
#define USBFS_UH_TOKEN_MASK 0xF0 // bit mask of token PID for USB host transfer
#define USBFS_UH_ENDP_MASK                                                     \
  0x0F // bit mask of endpoint number for USB host transfer

/* R8_UH_RX_CTRL */
#define USBFS_UH_R_AUTO_TOG                                                    \
  0x10 // enable automatic toggle after successful transfer completion: 0=manual
       // toggle, 1=automatic toggle
#define USBFS_UH_R_TOG                                                         \
  (1 << 7) // expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1
#define USBFS_UH_R_RES                                                         \
  0x01 // prepared handshake response type for host receiving (IN): 0=ACK
       // (ready), 1=no response, time out to device, for isochronous
       // transactions

/* R8_UH_TX_CTRL */
#define USBFS_UH_T_AUTO_TOG                                                    \
  0x10 // enable automatic toggle after successful transfer completion: 0=manual
       // toggle, 1=automatic toggle
#define USBFS_UH_T_TOG                                                         \
  (1 << 6) // prepared data toggle flag of host transmittal (SETUP/OUT):
           // 0=DATA0, 1=DATA1
#define USBFS_UH_T_RES                                                         \
  0x01 // expected handshake response type for host transmittal (SETUP/OUT):
       // 0=ACK (ready), 1=no response, time out from device, for isochronous
       // transactions

/*******************************************************************************/
/* Struct Definition */

/* USB Setup Request */
typedef struct __attribute__((packed)) _USB_SETUP_REQ {
  uint8_t  bRequestType;
  uint8_t  bRequest;
  uint16_t wValue;
  uint16_t wIndex;
  uint16_t wLength;
} USB_SETUP_REQ, *PUSB_SETUP_REQ;

/* USB Device Descriptor */
typedef struct __attribute__((packed)) _USB_DEVICE_DESCR {
  uint8_t  bLength;
  uint8_t  bDescriptorType;
  uint16_t bcdUSB;
  uint8_t  bDeviceClass;
  uint8_t  bDeviceSubClass;
  uint8_t  bDeviceProtocol;
  uint8_t  bMaxPacketSize0;
  uint16_t idVendor;
  uint16_t idProduct;
  uint16_t bcdDevice;
  uint8_t  iManufacturer;
  uint8_t  iProduct;
  uint8_t  iSerialNumber;
  uint8_t  bNumConfigurations;
} USB_DEV_DESCR, *PUSB_DEV_DESCR;

