lilindian16/RE_SWC_FW/lib/ch32_usbd/src/ch32x035_usbd.h
/* USB Configuration Descriptor */
typedef struct __attribute__((packed)) _USB_CONFIG_DESCR {
  uint8_t  bLength;
  uint8_t  bDescriptorType;
  uint16_t wTotalLength;
  uint8_t  bNumInterfaces;
  uint8_t  bConfigurationValue;
  uint8_t  iConfiguration;
  uint8_t  bmAttributes;
  uint8_t  MaxPower;
} USB_CFG_DESCR, *PUSB_CFG_DESCR;

/* USB Interface Descriptor */
typedef struct __attribute__((packed)) _USB_INTERF_DESCR {
  uint8_t bLength;
  uint8_t bDescriptorType;
  uint8_t bInterfaceNumber;
  uint8_t bAlternateSetting;
  uint8_t bNumEndpoints;
  uint8_t bInterfaceClass;
  uint8_t bInterfaceSubClass;
  uint8_t bInterfaceProtocol;
  uint8_t iInterface;
} USB_ITF_DESCR, *PUSB_ITF_DESCR;

/* USB Endpoint Descriptor */
typedef struct __attribute__((packed)) _USB_ENDPOINT_DESCR {
  uint8_t bLength;
  uint8_t bDescriptorType;
  uint8_t bEndpointAddress;
  uint8_t bmAttributes;
  uint8_t wMaxPacketSizeL;
  uint8_t wMaxPacketSizeH;
  uint8_t bInterval;
} USB_ENDP_DESCR, *PUSB_ENDP_DESCR;

/* USB Configuration Descriptor Set */
typedef struct __attribute__((packed)) _USB_CONFIG_DESCR_LONG {
  USB_CFG_DESCR  cfg_descr;
  USB_ITF_DESCR  itf_descr;
  USB_ENDP_DESCR endp_descr[1];
} USB_CFG_DESCR_LONG, *PUSB_CFG_DESCR_LONG;

/* USB HUB Descriptor */
typedef struct __attribute__((packed)) _USB_HUB_DESCR {
  uint8_t bDescLength;
  uint8_t bDescriptorType;
  uint8_t bNbrPorts;
  uint8_t wHubCharacteristicsL;
  uint8_t wHubCharacteristicsH;
  uint8_t bPwrOn2PwrGood;
  uint8_t bHubContrCurrent;
  uint8_t DeviceRemovable;
  uint8_t PortPwrCtrlMask;
} USB_HUB_DESCR, *PUSB_HUB_DESCR;

/* USB HID Descriptor */
typedef struct __attribute__((packed)) _USB_HID_DESCR {
  uint8_t  bLength;
  uint8_t  bDescriptorType;
  uint16_t bcdHID;
  uint8_t  bCountryCode;
  uint8_t  bNumDescriptors;
  uint8_t  bDescriptorTypeX;
  uint8_t  wDescriptorLengthL;
  uint8_t  wDescriptorLengthH;
} USB_HID_DESCR, *PUSB_HID_DESCR;

/* USB UDisk */
typedef struct __attribute__((packed)) _UDISK_BOC_CBW {
  uint32_t mCBW_Sig;
  uint32_t mCBW_Tag;
  uint32_t mCBW_DataLen;
  uint8_t  mCBW_Flag;
  uint8_t  mCBW_LUN;
  uint8_t  mCBW_CB_Len;
  uint8_t  mCBW_CB_Buf[16];
} UDISK_BOC_CBW, *PXUDISK_BOC_CBW;

/* USB UDisk */
typedef struct __attribute__((packed)) _UDISK_BOC_CSW {
  uint32_t mCBW_Sig;
  uint32_t mCBW_Tag;
  uint32_t mCSW_Residue;
  uint8_t  mCSW_Status;
} UDISK_BOC_CSW, *PXUDISK_BOC_CSW;

typedef struct {
  const uint8_t *device_descriptor;
  const uint8_t *config_descriptor;
  const uint8_t *language_descriptor;
  const uint8_t *manufacturer_descriptor;
  const uint8_t *prod_info_descriptor;
  const uint8_t *serial_num_info_descriptor;
  const uint8_t *consumer_report_descriptor;
  uint16_t       consumer_report_descriptor_length;
} Descriptor_Configs_t;

typedef enum {
  USB_DEVICE_MODE_BOOTLOADER,
  USB_DEVICE_MODE_HID,
} USB_Device_Mode_t;

/*******************************************************************************/
/* Variable Definition */
/* Global */
extern const uint8_t *pUSBFS_Descr;

/* Setup Request */
extern volatile uint8_t  USBFS_SetupReqCode;
extern volatile uint8_t  USBFS_SetupReqType;
extern volatile uint16_t USBFS_SetupReqValue;
extern volatile uint16_t USBFS_SetupReqIndex;
extern volatile uint16_t USBFS_SetupReqLen;

/* USB Device Status */
extern volatile uint8_t USBFS_DevConfig;
extern volatile uint8_t USBFS_DevAddr;
extern volatile uint8_t USBFS_DevSleepStatus;
extern volatile uint8_t USBFS_DevEnumStatus;

/* USB IN Endpoint Busy Flag */
extern volatile uint8_t USBFS_Endp_Busy[];

void    USBFS_Device_Init(FunctionalState       sta,
                          Descriptor_Configs_t *descriptor_config,
                          USB_Device_Mode_t     device_mode);
void    USBFS_Device_Endp_Init(void);
void    USBFS_RCC_Init(void);
void    USBFS_Sleep_Wakeup_Operate(void);
void    USB_Sleep_Wakeup_CFG(void);
uint8_t USBFS_Endp_DataUp(uint8_t endp, uint8_t *pbuf, uint16_t len,
                          uint8_t mod);
bool    is_endpoint_rx_pending(uint8_t endpoint);
uint8_t get_endpoint_rx_message(uint8_t endpoint, uint8_t *buffer,
                                size_t buffer_length);
bool    is_endpoint_tx_pending(uint8_t endpoint);

#ifdef __cplusplus
}
#endif

#endif //__CH32X035_USBD_H_